jmeter-tests/jmeter.log
2025-07-20 04:11:51,385 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2025-07-20 04:11:51,421 INFO o.a.j.JMeter: Loading user properties from: C:\Users\priti\Downloads\MicroBank360\jmeter-tests\apache-jmeter-5.6.3\bin\user.properties
2025-07-20 04:11:51,423 INFO o.a.j.JMeter: Loading system properties from: C:\Users\priti\Downloads\MicroBank360\jmeter-tests\apache-jmeter-5.6.3\bin\system.properties
2025-07-20 04:11:51,432 INFO o.a.j.JMeter: Copyright (c) 1998-2024 The Apache Software Foundation
2025-07-20 04:11:51,432 INFO o.a.j.JMeter: Version 5.6.3
2025-07-20 04:11:51,432 INFO o.a.j.JMeter: java.version=21.0.7
2025-07-20 04:11:51,432 INFO o.a.j.JMeter: java.vm.name=Java HotSpot(TM) 64-Bit Server VM
2025-07-20 04:11:51,432 INFO o.a.j.JMeter: os.name=Windows 11
2025-07-20 04:11:51,433 INFO o.a.j.JMeter: os.arch=amd64
2025-07-20 04:11:51,433 INFO o.a.j.JMeter: os.version=10.0
2025-07-20 04:11:51,433 INFO o.a.j.JMeter: file.encoding=UTF-8
2025-07-20 04:11:51,433 INFO o.a.j.JMeter: java.awt.headless=true
2025-07-20 04:11:51,433 INFO o.a.j.JMeter: Max memory     =1073741824
2025-07-20 04:11:51,433 INFO o.a.j.JMeter: Available Processors =8
2025-07-20 04:11:51,450 INFO o.a.j.JMeter: Default Locale=English (EN)
2025-07-20 04:11:51,450 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2025-07-20 04:11:51,450 INFO o.a.j.JMeter: JMeterHome=C:\Users\priti\Downloads\MicroBank360\jmeter-tests\apache-jmeter-5.6.3
2025-07-20 04:11:51,450 INFO o.a.j.JMeter: user.dir  =C:\Users\priti\Downloads\MicroBank360\jmeter-tests
2025-07-20 04:11:51,451 INFO o.a.j.JMeter: PWD       =C:\Users\priti\Downloads\MicroBank360\jmeter-tests
2025-07-20 04:11:51,464 INFO o.a.j.JMeter: IP: 192.168.1.179 Name: piti FullName: piti.lan
2025-07-20 04:11:51,489 INFO o.a.j.s.FileServer: Default base='C:\Users\priti\Downloads\MicroBank360\jmeter-tests'
2025-07-20 04:11:51,491 INFO o.a.j.s.FileServer: Set new base='C:\Users\priti\Downloads\MicroBank360\jmeter-tests'
2025-07-20 04:11:51,800 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2025-07-20 04:11:51,854 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2025-07-20 04:11:51,859 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2025-07-20 04:11:51,863 INFO o.a.j.s.SaveService: Loading file: foolproof-test.jmx
2025-07-20 04:11:51,958 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-07-20 04:11:51,959 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-07-20 04:11:51,959 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-07-20 04:11:51,959 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-07-20 04:11:51,959 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2025-07-20 04:11:51,959 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2025-07-20 04:11:51,975 INFO o.a.j.JMeter: Creating summariser <summary>
2025-07-20 04:11:52,011 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2025-07-20 04:11:52,012 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2025-07-20 04:11:52,013 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2025-07-20 04:11:52,020 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2025-07-20 04:11:52,020 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2025-07-20 04:11:52,145 INFO o.a.j.JMeter: Running test (1752999112145)
2025-07-20 04:11:52,178 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Simple Test Group
2025-07-20 04:11:52,178 INFO o.a.j.e.StandardJMeterEngine: Starting 5 threads for group Simple Test Group.
2025-07-20 04:11:52,178 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2025-07-20 04:11:52,178 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=5 ramp-up=5 delayedStart=false
2025-07-20 04:11:52,187 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2025-07-20 04:11:52,187 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2025-07-20 04:11:52,194 INFO o.a.j.t.JMeterThread: Thread started: Simple Test Group 1-1
2025-07-20 04:11:53,190 INFO o.a.j.t.JMeterThread: Thread started: Simple Test Group 1-2
2025-07-20 04:11:53,241 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = piti
2025-07-20 04:11:53,254 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2025-07-20 04:11:53,258 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2025-07-20 04:11:53,258 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to UTF-8
2025-07-20 04:11:53,258 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2025-07-20 04:11:53,258 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2025-07-20 04:11:54,189 INFO o.a.j.t.JMeterThread: Thread started: Simple Test Group 1-3
2025-07-20 04:11:55,190 INFO o.a.j.t.JMeterThread: Thread started: Simple Test Group 1-4
2025-07-20 04:11:56,189 INFO o.a.j.t.JMeterThread: Thread started: Simple Test Group 1-5
2025-07-20 04:12:00,341 INFO o.a.j.r.Summariser: summary +     25 in 00:00:08 =    3.1/s Avg:   104 Min:    13 Max:  1251 Err:     0 (0.00%) Active: 5 Started: 5 Finished: 0
2025-07-20 04:12:30,240 INFO o.a.j.r.Summariser: summary +    145 in 00:00:30 =    4.8/s Avg:    22 Min:     7 Max:   110 Err:     0 (0.00%) Active: 5 Started: 5 Finished: 0
2025-07-20 04:12:30,242 INFO o.a.j.r.Summariser: summary =    170 in 00:00:38 =    4.5/s Avg:    34 Min:     7 Max:  1251 Err:     0 (0.00%)
2025-07-20 04:12:34,977 INFO o.a.j.t.JMeterThread: Thread is done: Simple Test Group 1-2
2025-07-20 04:12:34,977 INFO o.a.j.t.JMeterThread: Thread is done: Simple Test Group 1-1
2025-07-20 04:12:34,977 INFO o.a.j.t.JMeterThread: Thread finished: Simple Test Group 1-2
2025-07-20 04:12:34,977 INFO o.a.j.t.JMeterThread: Thread finished: Simple Test Group 1-1
2025-07-20 04:12:35,364 INFO o.a.j.t.JMeterThread: Thread is done: Simple Test Group 1-3
2025-07-20 04:12:35,364 INFO o.a.j.t.JMeterThread: Thread finished: Simple Test Group 1-3
2025-07-20 04:12:36,459 INFO o.a.j.t.JMeterThread: Thread is done: Simple Test Group 1-4
2025-07-20 04:12:36,459 INFO o.a.j.t.JMeterThread: Thread finished: Simple Test Group 1-4
2025-07-20 04:12:37,478 INFO o.a.j.t.JMeterThread: Thread is done: Simple Test Group 1-5
2025-07-20 04:12:37,478 INFO o.a.j.t.JMeterThread: Thread finished: Simple Test Group 1-5
2025-07-20 04:12:37,478 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2025-07-20 04:12:37,478 INFO o.a.j.r.Summariser: summary +     30 in 00:00:07 =    4.1/s Avg:    21 Min:     9 Max:    33 Err:     0 (0.00%) Active: 0 Started: 5 Finished: 5
2025-07-20 04:12:37,489 INFO o.a.j.r.Summariser: summary =    200 in 00:00:45 =    4.4/s Avg:    32 Min:     7 Max:  1251 Err:     0 (0.00%)